balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F8628.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="TRISG" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="TRISG" edc:nzwidth="0x8" edc:por="---11111">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DDRG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISG0" edc:desc="" edc:mask="0x1" edc:name="TRISG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG1" edc:desc="" edc:mask="0x1" edc:name="TRISG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG2" edc:desc="" edc:mask="0x1" edc:name="TRISG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG3" edc:desc="" edc:mask="0x1" edc:name="TRISG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG4" edc:desc="" edc:mask="0x1" edc:name="TRISG4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISG" edc:desc="" edc:mask="0xff" edc:name="TRISG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG0" edc:desc="" edc:mask="0x1" edc:name="RG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG1" edc:desc="" edc:mask="0x1" edc:name="RG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG2" edc:desc="" edc:mask="0x1" edc:name="RG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG3" edc:desc="" edc:mask="0x1" edc:name="RG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG4" edc:desc="" edc:mask="0x1" edc:name="RG4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISH" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DDRH"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISH0" edc:desc="" edc:mask="0x1" edc:name="TRISH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH1" edc:desc="" edc:mask="0x1" edc:name="TRISH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH2" edc:desc="" edc:mask="0x1" edc:name="TRISH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH3" edc:desc="" edc:mask="0x1" edc:name="TRISH3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH4" edc:desc="" edc:mask="0x1" edc:name="TRISH4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH5" edc:desc="" edc:mask="0x1" edc:name="TRISH5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH6" edc:desc="" edc:mask="0x1" edc:name="TRISH6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISH7" edc:desc="" edc:mask="0x1" edc:name="TRISH7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISH" edc:desc="" edc:mask="0xff" edc:name="TRISH" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RH0" edc:desc="" edc:mask="0x1" edc:name="RH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH1" edc:desc="" edc:mask="0x1" edc:name="RH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH2" edc:desc="" edc:mask="0x1" edc:name="RH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH3" edc:desc="" edc:mask="0x1" edc:name="RH3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH4" edc:desc="" edc:mask="0x1" edc:name="RH4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH5" edc:desc="" edc:mask="0x1" edc:name="RH5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH6" edc:desc="" edc:mask="0x1" edc:name="RH6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RH7" edc:desc="" edc:mask="0x1" edc:name="RH7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISJ" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISJ" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DDRJ"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISJ0" edc:desc="" edc:mask="0x1" edc:name="TRISJ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ1" edc:desc="" edc:mask="0x1" edc:name="TRISJ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ2" edc:desc="" edc:mask="0x1" edc:name="TRISJ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ3" edc:desc="" edc:mask="0x1" edc:name="TRISJ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ4" edc:desc="" edc:mask="0x1" edc:name="TRISJ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ5" edc:desc="" edc:mask="0x1" edc:name="TRISJ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ6" edc:desc="" edc:mask="0x1" edc:name="TRISJ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISJ7" edc:desc="" edc:mask="0x1" edc:name="TRISJ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISJ" edc:desc="" edc:mask="0xff" edc:name="TRISJ" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RJ0" edc:desc="" edc:mask="0x1" edc:name="RJ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ1" edc:desc="" edc:mask="0x1" edc:name="RJ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ2" edc:desc="" edc:mask="0x1" edc:name="RJ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ3" edc:desc="" edc:mask="0x1" edc:name="RJ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ4" edc:desc="" edc:mask="0x1" edc:name="RJ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ5" edc:desc="" edc:mask="0x1" edc:name="RJ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ6" edc:desc="" edc:mask="0x1" edc:name="RJ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RJ7" edc:desc="" edc:mask="0x1" edc:name="RJ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="OSCTUNE" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="OSCTUNE" edc:nzwidth="0x8" edc:por="00-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x1f" edc:name="TUN" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PLLEN" edc:desc="" edc:mask="0x1" edc:name="PLLEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTSRC" edc:desc="" edc:mask="0x1" edc:name="INTSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TUN4" edc:desc="" edc:mask="0x1" edc:name="TUN4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nn--nn" edc:cname="MEMCON" edc:desc="" edc:impl="0xb3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00--00" edc:name="MEMCON" edc:nzwidth="0x8" edc:por="0-00--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WM" edc:desc="" edc:mask="0x3" edc:name="WM" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="WAIT" edc:desc="" edc:mask="0x3" edc:name="WAIT" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EBDIS" edc:desc="" edc:mask="0x1" edc:name="EBDIS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WM0" edc:desc="" edc:mask="0x1" edc:name="WM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WM1" edc:desc="" edc:mask="0x1" edc:name="WM1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="WAIT0" edc:desc="" edc:mask="0x1" edc:name="WAIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAIT1" edc:desc="" edc:mask="0x1" edc:name="WAIT1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:desc="" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:desc="" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:desc="" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP1IE" edc:desc="" edc:mask="0x1" edc:name="SSP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX1IE" edc:desc="" edc:mask="0x1" edc:name="TX1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1IE" edc:desc="" edc:mask="0x1" edc:name="RC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSPIE" edc:desc="" edc:mask="0x1" edc:name="PSPIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SSPIE" edc:desc="" edc:mask="0x1" edc:name="SSPIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXIE" edc:desc="" edc:mask="0x1" edc:name="TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIE" edc:desc="" edc:mask="0x1" edc:name="RCIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
